#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validtion 🤖`success`
#### Terraform Plan 📖`success`

#### Preview environment 🔗
[[command]/home/runner/work/_temp/3b4f182a-8e3b-46e1-936a-4a19b04be5ee/terraform-bin output URL]([command]/home/runner/work/_temp/3b4f182a-8e3b-46e1-936a-4a19b04be5ee/terraform-bin output URL)

<details><summary>Show plan for apply after merge to master</summary>

```hcl

terraform
Acquiring state lock. This may take a few moments...
module.aws-deploy.aws_ecs_task_definition.main: Refreshing state... [id=bekk-arrangement-svc-dev]
module.aws-deploy.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/bekk-arrangement-svc-dev/2ce04acd3c5167ac]
module.aws-deploy.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev]
module.aws-deploy.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/ef7a2da1059ded70]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-deploy.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev"
        name                               = "bekk-arrangement-svc-dev"
        tags                               = {
            "Terraform" = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:18" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.aws-deploy.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:18" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "882089634282.dkr.ecr.eu-central-1.amazonaws.com/arrangement-svc:38" -> ":latest"
                    name             = "bekk-arrangement-svc-dev"
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "bekk-arrangement-svc-dev" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
        tags                     = {
            "Name"      = "bekk-arrangement-svc-dev"
            "Terraform" = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @omaen, Action: `pull_request`*